Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetMEPAnalyticalModelData(Autodesk.Revit.DB.Element)
Gets the MEP analytical model data of the specified element.
pElement:
The element that owns the MEP analytical model data.
Returns:
The MEP analytical model data of this element, null if not available.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNodeByIndex(System.Int32)
Gets the specified analytical node.
index:
The node index number by their storing sequence, starting from 0.
Returns:
The returned analytical node.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index must range from 0 to GetNumberOfNodes()-1.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidNodeId(System.Int32)
Verifies if a valid analytical node id.
nodeId:
The node id to be verified.
Returns:
True if valid, otherwise false.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNodeById(System.Int32)
Gets the analytical node with the specified id.
nodeId:
The node identifier, be aware that this identifier may not be sequentially ordered for all analytical nodes.
Returns:
The returned analytical node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input must be a valid node id.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfSegments
Returns the number of analytical segments.
Returns:
The total number of
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfNodes
Returns the number of analytical nodes.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetSegmentData(System.Int32)
Gets the analysis data on the specified segment.
segmentId:
The segment id to be retrieved.
Returns:
The calculated data of this segment. Be aware that the segment data may be invalid if the calculation failed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input must be a valid segment id.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidSegmentId(System.Int32)
Verifies if a valid segment id.
segmentId:
The segment id to be verified.
Returns:
True if the id is a valid segment id, otherwise false.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetSegmentByIndex(System.Int32)
Gets the analytical segment at the specified position.
index:
The index where the segment is stored. This index is 0 based.
Returns:
The returned analytical segment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index must range from 0 to GetNumberOfSegments()-1.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetSegmentById(System.Int32)
Gets the analytical segment with the specified id.
segmentId:
The segment id to be retrieved. This id is not 0 based.
Returns:
The returned analytical segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input must be a valid segment id.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
Represents the MEP analytical model data attached to individual element.
Remarks:
The MEP analytical model is composed of generic analytical segments and nodes.
Each Revit element may have one or more analytical segments. Connected together,
these data form a network that is used in the flow and pressure drop calculation.
Since:
2024